# Хэш это ассоциативный массив, словарь
# Используются как параметры для чего либо, это очень удобно
#
#Остановился на 1:27:55
#
#Инициализируем пустой хэш
#hh = {}
#Инициализируем хэш с записью, ключ => значение
hh = {
	:Fyodor => '+79773629439',
	:Jessie => '+14562626676'
}

#добавляем значение в хэш
# Хэш[ключ] = значение
hh[:Margo] = '+70078282374'


#Выводим элемент хэша
#Переменная = Хэш[ключ]
name = hh[:Fyodor]

#Вызвать элемент из хэша
# Хэш[ключ] - выведет результат

#выводим весь хэш на экран
puts hh

# Чтобы вывести информацию из хэша красиво делаем следующее
# Используем each do |key,value|
#
#
#
#
#
#